#Predicción de supervivientes del Titanic

ejercicio práctico de Machine Learning sobre el (famoso) accidente ocurrido en el Titanic, las tragicas muertes que caracterizó este, pero sobretodo los sobrevivientes, la idea principal es buscar un modelo de machine learning que permita inferir un estimado preciso de supervivientes.
link de la base de datos: https://www.kaggle.com/competitions/titanic

In [ ]:
#importamos librerias
import pandas as pd
import numpy as np

In [ ]:
#importar datos
testurl = 'https://raw.githubusercontent.com/trejoalcantazo/TitanicMLFromDisaster/main/titanic/test.csv'
trainurl = 'https://raw.githubusercontent.com/trejoalcantazo/TitanicMLFromDisaster/main/titanic/train.csv'

df_test = pd.read_csv (testurl)
df_train = pd.read_csv (trainurl)

In [ ]:
# 11 columnas
df_test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [ ]:
# 12 columnas (survived extra)
df_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# Traduccion de titulos para mejor entendimiento de data
traduccion1_test = ["ID","Clase", "Nombre", "Sexo", "Edad", "Hermanos","Hijos","Ticket", "Tarifa","Cabina", "Embarque"]
traduccion2_train = ["ID","Sobreviviente","Clase", "Nombre", "Sexo", "Edad", "Hermanos","Hijos","Ticket", "Tarifa","Cabina", "Embarque"]
df_test.columns = traduccion1_test
df_train.columns = traduccion2_train

df_test
df_train

,ID,Sobreviviente,Clase,Nombre,Sexo,Edad,Hermanos,Hijos,Ticket,Tarifa,Cabina,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# se guarda la edicion reciente en el archivo csv.
testurl = 'https://raw.githubusercontent.com/trejoalcantazo/TitanicMLFromDisaster/main/titanic/test.csv'
trainurl = 'https://raw.githubusercontent.com/trejoalcantazo/TitanicMLFromDisaster/main/titanic/train.csv'

df_test.to_csv (testurl)
df_train.to_csv (trainurl)

#Entendiendo la data:

In [ ]:
#cantidad de datos
df_test.shape

(418, 11)

In [ ]:
#columna adicional "survived"
df_train.shape

(891, 12)

In [ ]:
#tipo de datos
df_train.info()
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ID             891 non-null    int64
 1   Sobreviviente  891 non-null    int64
 2   Clase          891 non-null    int64
 3   Nombre         891 non-null    object
 4   Sexo           891 non-null    object
 5   Edad           714 non-null    float64
 6   Hermanos       891 non-null    int64
 7   Hijos          891 non-null    int64
 8   Ticket         891 non-null    object
 9   Tarifa         891 non-null    float64
 10  Cabina         204 non-null    object
 11  Embarque       889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ID        418 non-null    int64
 1   Clase     418 non-null    int64
 2   Nombre    418 non-null    object
 3   Sexo      418 non-null    object
 4   Edad      332 non-null    float64
 5   Hermanos  418 non-null    int64
 6   Hijos     418 non-null    int64
 7   Ticket    418 non-null    object
 8   Tarifa    417 non-null    float64
 9   Cabina    91 non-null     object
 10  Embarque  418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [ ]:
#datos faltantes, numeros = datos faltantes por categoria
print(pd.isnull(df_train).sum())
print(pd.isnull(df_test).sum())

ID                 0
Sobreviviente      0
Clase              0
Nombre             0
Sexo               0
Edad             177
Hermanos           0
Hijos              0
Ticket             0
Tarifa             0
Cabina           687
Embarque           2
dtype: int64
ID            0
Clase         0
Nombre        0
Sexo          0
Edad         86
Hermanos      0
Hijos         0
Ticket        0
Tarifa        1
Cabina      327
Embarque      0
dtype: int64

In [ ]:
#Estadistica verificacion datos
print(df_train.describe())
print(df_test.describe())

               ID  Sobreviviente       Clase        Edad    Hermanos  \
count  891.000000     891.000000  891.000000  714.000000  891.000000
mean   446.000000       0.383838    2.308642   29.699118    0.523008
std    257.353842       0.486592    0.836071   14.526497    1.102743
min      1.000000       0.000000    1.000000    0.420000    0.000000
25%    223.500000       0.000000    2.000000   20.125000    0.000000
50%    446.000000       0.000000    3.000000   28.000000    0.000000
75%    668.500000       1.000000    3.000000   38.000000    1.000000
max    891.000000       1.000000    3.000000   80.000000    8.000000

            Hijos      Tarifa
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200
                ID       Clase        Edad    Hermanos       Hijos      Tarifa
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

#Procesamiento de la data